# Pandas

##### Pandas - Open Source Library in Python

###### Data Manipulation and analysis

In [3]:
### importing pandas
import pandas as pd

#### Series - One dimensional

##### Data Frame - Multi dimensional

In [5]:
eg= pd.Series([19,24,30])

In [6]:
eg

0    19
1    24
2    30
dtype: int64

In [7]:
import numpy as np

In [8]:
### alternate code
age=pd.Series(np.array([19,24,30,41,53]))

In [9]:
age

0    19
1    24
2    30
3    41
4    53
dtype: int32

In [10]:
age= pd.Series([20,12,43,45,65,66], index=[0,2,4,6,8,10])
age

0     20
2     12
4     43
6     45
8     65
10    66
dtype: int64

In [11]:
### alternate way
age=pd.Series(np.array([20,12,43,45,65,66]), index=np.arange(0,12,2))

In [12]:
age

0     20
2     12
4     43
6     45
8     65
10    66
dtype: int32

In [17]:
##age.set_index(["A1","A2","A3","A4","A5","A6"])
age= pd.Series([20,12,43,45,65,66], index=["A1","A2","A3","A4","A5","A6"])
age

A1    20
A2    12
A3    43
A4    45
A5    65
A6    66
dtype: int64

In [20]:
df=pd.Series({"Dairy":23000,"Soft Drinks":45000,"Fruits and Vegetables":67000})
df

Dairy                    23000
Soft Drinks              45000
Fruits and Vegetables    67000
dtype: int64

In [23]:
df=pd.Series({"X":["Maths","Science","English"],"Y":["Maths","Science"],"Z":["Science"]})
df

X    [Maths, Science, English]
Y             [Maths, Science]
Z                    [Science]
dtype: object

In [36]:
df[["X","Y"]]

X    [Maths, Science, English]
Y             [Maths, Science]
dtype: object

In [25]:
print(df.index)

Index(['X', 'Y', 'Z'], dtype='object')

In [26]:
df.values

array([list(['Maths', 'Science', 'English']), list(['Maths', 'Science']),
       list(['Science'])], dtype=object)

In [27]:
emp=np.array(["A1","A2","A3","A4","A5","A6","A7","A8","A9"])
emp_series=pd.Series(emp)

In [28]:
emp_series

0    A1
1    A2
2    A3
3    A4
4    A5
5    A6
6    A7
7    A8
8    A9
dtype: object

In [29]:
emp_series[0:5] ## Top 4 values

0    A1
1    A2
2    A3
3    A4
4    A5
dtype: object

In [30]:
emp_series[4:] ## 5th value onward

4    A5
5    A6
6    A7
7    A8
8    A9
dtype: object

In [31]:
emp_series[-5:]

4    A5
5    A6
6    A7
7    A8
8    A9
dtype: object

In [40]:
stud_series=pd.Series({"sophia":450,"Mia":303,"Philip":432,"Emma":150,"Lilly":293,"Grace":112})
stud_series

sophia    450
Mia       303
Philip    432
Emma      150
Lilly     293
Grace     112
dtype: int64

In [42]:
stud_series[stud_series>300]

sophia    450
Mia       303
Philip    432
dtype: int64

In [43]:
stud_series[stud_series<200]

Emma     150
Grace    112
dtype: int64

In [46]:
stud_series[(stud_series>200) & (stud_series<300)]

Lilly    293
dtype: int64

In [49]:
### Concatenation
class1=np.linspace(0,20,11)
class2=np.linspace(1,21,11)

In [51]:
class1_series=pd.Series(class1)
class2_series=pd.Series(class2)

In [54]:
class2_series

0      1.0
1      3.0
2      5.0
3      7.0
4      9.0
5     11.0
6     13.0
7     15.0
8     17.0
9     19.0
10    21.0
dtype: float64

In [53]:
pd.concat([class1_series,class2_series])

0      0.0
1      2.0
2      4.0
3      6.0
4      8.0
5     10.0
6     12.0
7     14.0
8     16.0
9     18.0
10    20.0
0      1.0
1      3.0
2      5.0
3      7.0
4      9.0
5     11.0
6     13.0
7     15.0
8     17.0
9     19.0
10    21.0
dtype: float64

In [56]:
pd.concat([class1_series,class2_series], keys=["Even","Odd"], names=["category","index"])

category  index
Even      0         0.0
          1         2.0
          2         4.0
          3         6.0
          4         8.0
          5        10.0
          6        12.0
          7        14.0
          8        16.0
          9        18.0
          10       20.0
Odd       0         1.0
          1         3.0
          2         5.0
          3         7.0
          4         9.0
          5        11.0
          6        13.0
          7        15.0
          8        17.0
          9        19.0
          10       21.0
dtype: float64

In [ ]:
pd.concat([class1_series,class2_series], keys=["Even","Odd"], names=["category","index"], ignore_index=True)

In [57]:
class1_series.append(class2_series,ignore_index=True)

C:\Users\bansa\AppData\Local\Temp\ipykernel_12980\4230697910.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  class1_series.append(class2_series,ignore_index=True)

0      0.0
1      2.0
2      4.0
3      6.0
4      8.0
5     10.0
6     12.0
7     14.0
8     16.0
9     18.0
10    20.0
11     1.0
12     3.0
13     5.0
14     7.0
15     9.0
16    11.0
17    13.0
18    15.0
19    17.0
20    19.0
21    21.0
dtype: float64

### DataFrame

In [60]:
df1=pd.DataFrame({"Month":["Jan","Jan","Jan","Jan","Jan","Feb","Feb","Feb","Feb","Mar"],
                          "Store":["A","B","C","D","E","A","B","C","D","A"],
                         "Sales":[30124,65214,24550,34645,29314,65121,29357,46267,31584,14320]})
df1

  Month Store  Sales
0   Jan     A  30124
1   Jan     B  65214
2   Jan     C  24550
3   Jan     D  34645
4   Jan     E  29314
5   Feb     A  65121
6   Feb     B  29357
7   Feb     C  46267
8   Feb     D  31584
9   Mar     A  14320

In [61]:
df1.head()

  Month Store  Sales
0   Jan     A  30124
1   Jan     B  65214
2   Jan     C  24550
3   Jan     D  34645
4   Jan     E  29314

In [62]:
df1.tail()

  Month Store  Sales
5   Feb     A  65121
6   Feb     B  29357
7   Feb     C  46267
8   Feb     D  31584
9   Mar     A  14320

In [63]:
df1.shape

(10, 3)

In [64]:
df1.dtypes

Month    object
Store    object
Sales     int64
dtype: object

In [65]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Month   10 non-null     object
 1   Store   10 non-null     object
 2   Sales   10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

##### .iloc-> Retrives the rows and columns by indexm

####  loc -> Retrives row and column by name

In [67]:
df1.iloc[1]

Month      Jan
Store        B
Sales    65214
Name: 1, dtype: object

In [68]:
df1.iloc[0]

Month      Jan
Store        A
Sales    30124
Name: 0, dtype: object

In [69]:
df1.iloc[0]["Store"] ### First fetch row using iloc and then use column name to fetch particular value

'A'

In [70]:
df1.iloc[3:6]

  Month Store  Sales
3   Jan     D  34645
4   Jan     E  29314
5   Feb     A  65121

In [71]:
df1.iloc[:,2]

0    30124
1    65214
2    24550
3    34645
4    29314
5    65121
6    29357
7    46267
8    31584
9    14320
Name: Sales, dtype: int64

In [73]:
df1.iloc[:,1:]

  Store  Sales
0     A  30124
1     B  65214
2     C  24550
3     D  34645
4     E  29314
5     A  65121
6     B  29357
7     C  46267
8     D  31584
9     A  14320

In [76]:
df1.iloc[:,0:2]

  Month Store
0   Jan     A
1   Jan     B
2   Jan     C
3   Jan     D
4   Jan     E
5   Feb     A
6   Feb     B
7   Feb     C
8   Feb     D
9   Mar     A

In [77]:
df1.iloc[:,:2] ##first two columns

  Month Store
0   Jan     A
1   Jan     B
2   Jan     C
3   Jan     D
4   Jan     E
5   Feb     A
6   Feb     B
7   Feb     C
8   Feb     D
9   Mar     A

In [78]:
df1.iloc[:,[0,2]]

  Month  Sales
0   Jan  30124
1   Jan  65214
2   Jan  24550
3   Jan  34645
4   Jan  29314
5   Feb  65121
6   Feb  29357
7   Feb  46267
8   Feb  31584
9   Mar  14320

In [79]:
df1.iloc[1]["Sales"]

65214

In [81]:
df1.loc[1]["Sales"]

65214

In [82]:
df1

  Month Store  Sales
0   Jan     A  30124
1   Jan     B  65214
2   Jan     C  24550
3   Jan     D  34645
4   Jan     E  29314
5   Feb     A  65121
6   Feb     B  29357
7   Feb     C  46267
8   Feb     D  31584
9   Mar     A  14320

In [85]:
df1.loc[[0,1,2],["Store","Sales"]]

  Store  Sales
0     A  30124
1     B  65214
2     C  24550

In [89]:
#### Sales >40000
##df1[df1["Sales"]>40000]
df1[df1.Sales>40000]

  Month Store  Sales
1   Jan     B  65214
5   Feb     A  65121
7   Feb     C  46267

In [90]:
## Get January month sales when>30000
df1[(df1.Month=="Jan")&(df1.Sales>30000)]

  Month Store  Sales
0   Jan     A  30124
1   Jan     B  65214
3   Jan     D  34645

In [92]:
df1.sort_values("Sales")

  Month Store  Sales
9   Mar     A  14320
2   Jan     C  24550
4   Jan     E  29314
6   Feb     B  29357
0   Jan     A  30124
8   Feb     D  31584
3   Jan     D  34645
7   Feb     C  46267
5   Feb     A  65121
1   Jan     B  65214

In [93]:
df1.sort_values("Sales", ascending=False)

  Month Store  Sales
1   Jan     B  65214
5   Feb     A  65121
7   Feb     C  46267
3   Jan     D  34645
8   Feb     D  31584
0   Jan     A  30124
6   Feb     B  29357
4   Jan     E  29314
2   Jan     C  24550
9   Mar     A  14320

In [ ]:
## when there are two sheets in an excel file
df1=pd.read_csv